#include <iostream>

/*
* последовательные контейнеры - это контейнеры в которых поиск в худшем случае может потребовать перебор всех елементов
* асотиативные контейнеры - это контейнеры которые имеют болле оптимизированый поиск
* 
* все контейнеры имеют общий интерфейс

    Общие вложеные типы:
    - Container::value_type
    - Container::iterator
    - Container::const_iterator

    Общие методы контейнеров:
    - все (конструкторы деструкторы операторы...) а также метод swap
    - size, max_size, empty,clear
    - begin, end, cbegin, cend
    - Операторы сравнение: ==, !=, >, >=, <, <=
*/

int main(int argc, const char * argv[]) 
{


    return 0;
}