#include <iostream>

/*
* !!Методы по умолчанию!! - эти методы компилятор умеет создавать самостоятельно и 
для них можно использовать ключевое слово <default>
* конструктор по умолчанию
* конструктор копирования
* оператор присваивания
* деструктор
* перемещающий конструктоор
* перемещающий оператор присваивания

!! перемещающие методы генерироваться только если в классе отсутстувует пользовательские копирующие операции, перемещающие
операции и деструктор
*/

int main(int argc, const char * argv[]) 
{

    return 0;
}